aerospace
appcleaner
bitwarden
cyberduck
discord
displaylink
firefox
font-fira-code
font-fira-code-nerd-font
font-source-code-pro
hiddenbar
iterm2
itsycal
logi-options+
logi-options-plus
monitorcontrol
onyx
postman
raycast
slack
stats
visual-studio-code
whatsapp
wireshark
zed
zoom
