# Taps
tap "nikitabobko/tap"
tap "felixkratz/formulae"
tap "zkondor/dist"
tap "homebrew/cask-fonts"  # For fonts

# Fonts
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-anonymous-pro"
cask "font-hack-nerd-font"

# Brews (Formulae)
brew "mas"
brew "borders"
brew "tmux"
brew "bash"
brew "cdktf"
brew "fastfetch"

# Converted from Nix packages
brew "ollama"
brew "neovim"
brew "asciinema"
brew "bat"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "terraform"
brew "ipcalc"
brew "jq"
brew "libffi"
brew "stow"
brew "uv"
brew "poetry"
brew "ruff"
brew "speedtest-cli"
brew "sshpass"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tree"
brew "wget"
brew "zoxide"
brew "zsh"
brew "lazygit"
brew "inetutils"
brew "open-policy-agent"

# Casks
cask "font-monaspace"
cask "hazeover"
cask "karabiner-elements"
cask "firefox"
cask "aerospace"
cask "appcleaner"
cask "discord"
cask "displaylink"
cask "iterm2"
cask "itsycal"
cask "monitorcontrol"
cask "onyx"
cask "slack"
cask "stats"
cask "visual-studio-code"
cask "zed"
cask "wireshark"
cask "whatsapp"
cask "zoom"
cask "raycast"
cask "sf-symbols"
cask "1password"
cask "1password-cli"
cask "only-switch"
cask "rocket"
cask "chatgpt"
cask "ghostty"
cask "drawio"

# Mac App Store apps
mas "hiddenbar", id: 1452453066
